In [1]:
import pandas as pd

In [2]:
data2 = pd.read_excel('DDW-C18-0000.xlsx')

In [3]:
new_col = ['state','District','Area','Total','Age','S_persons','S_males','S_females','T_persons','T_males','T_females']

In [4]:
data2.columns = new_col

In [5]:
data2 = data2.iloc[5:]

In [6]:
new_data2 = data2.copy(deep=True)

In [7]:
new_data2

,state,District,Area,Total,Age,S_persons,S_males,S_females,T_persons,T_males,T_females
5,00,00,INDIA,Total,Total,314988770,176696383,138292387,86009580,50536832,35472748
6,00,00,INDIA,Total,5-9,15649192,8166843,7482349,1844108,978151,865957
7,00,00,INDIA,Total,10-14,34488492,18133423,16355069,7254335,3831131,3423204
8,00,00,INDIA,Total,15-19,42424599,22750908,19673691,12626717,6792766,5833951
9,00,00,INDIA,Total,20-24,41344406,22386694,18957712,12834334,7067614,5766720
...,...,...,...,...,...,...,...,...,...,...,...
1080,35,00,ANDAMAN & NICOBAR ISLANDS,Urban,25-29,13065,7012,6053,4364,2355,2009
1081,35,00,ANDAMAN & NICOBAR ISLANDS,Urban,30-49,38406,21301,17105,13320,7824,5496
1082,35,00,ANDAMAN & NICOBAR ISLANDS,Urban,50-69,12899,7903,4996,4177,2842,1335
1083,35,00,ANDAMAN & NICOBAR ISLANDS,Urban,70+,1644,1016,628,432,305,127
1084,35,00,ANDAMAN & NICOBAR ISLANDS,Urban,Age not stated,134,70,64,38,19,19

In [8]:
new_data2 = new_data2.drop(['District','S_persons','S_males','S_females','T_males','T_females'],axis=1)

In [9]:
fin_data2 = new_data2.loc[(new_data2['Total'] != 'Rural') & (new_data2['Total'] != 'Urban')]

In [10]:
india = fin_data2[fin_data2['Area']=='INDIA'].copy()

In [11]:
data1 = pd.read_excel('DDW-0000C-13.xls')

In [12]:
new_col2 = ['Table name','state code','District code','Area','Age','total_person','tot_male','tot_female','total_person_rural','tot_male_rural','tot_female_rural','total_person_urban','tot_male_urban','tot_female_urban']

In [13]:
data1.columns = new_col2
data1 = data1.iloc[6:]

In [14]:
data1 = data1[['state code','District code','Area','Age','total_person']].copy()

In [15]:
india2 = data1[data1['Area'] == 'India'].copy()

In [16]:
india2[['total_person']] = india2[['total_person']].apply(pd.to_numeric)

state code       object
District code    object
Area             object
Age              object
total_person      int64
dtype: object

In [17]:
india

   state   Area  Total             Age T_persons
5     00  INDIA  Total           Total  86009580
6     00  INDIA  Total             5-9   1844108
7     00  INDIA  Total           10-14   7254335
8     00  INDIA  Total           15-19  12626717
9     00  INDIA  Total           20-24  12834334
10    00  INDIA  Total           25-29  10857171
11    00  INDIA  Total           30-49  27466884
12    00  INDIA  Total           50-69  10916361
13    00  INDIA  Total             70+   1954539
14    00  INDIA  Total  Age not stated    255131

In [18]:
final_sum = [86009580]
a = [5,10,15,20,25,30,50,70]
b = [9,14,19,24,29,49,69,99]
for i,j in zip(a,b):
    val = 0
    for k in range(i,j+1):
        row = india2.loc[india2['Age'] == k].values.flatten().tolist()
        val+=row[-1]
    final_sum.append(val)

In [19]:
r = india2[india2['Age'] == 'Age not stated'].values.flatten().tolist()
final_sum.append(r[-1])

In [20]:
india['new_col'] = final_sum

In [21]:
india['percentage'] = (india['T_persons']/india['new_col'])*100

In [22]:
india = india[1:].copy()

In [23]:
india.sort_values("percentage", axis = 0, ascending = False,inplace = True, na_position ='last')

In [24]:
fin_ind = india.iloc[0].to_frame().transpose()

In [25]:
fin_ind = fin_ind[['state','Age','percentage']].copy()

In [26]:
fin_ind = fin_ind.rename(columns={'state':'state/ut','Age': 'age-group'})

In [27]:
fin_ind

  state/ut age-group percentage
9       00     20-24  11.518442

In [28]:
new_data2 = new_data2[new_data2['Area']!='INDIA'].copy()

In [29]:
data1 = data1[data1['Area']!='India'].copy()

In [30]:
data1['Area'] = data1['Area'].str.lower()

In [31]:
new_data2['Area'] = new_data2['Area'].str.lower()

In [32]:
len(data1.Area)

3605

In [33]:
the_list = data1.Area.unique()
the_list

array(['state - jammu & kashmir (01)', 'state - himachal pradesh (02)',
       'state - punjab (03)', 'state - chandigarh (04)',
       'state - uttarakhand (05)', 'state - haryana (06)',
       'state - nct of delhi (07)', 'state - rajasthan (08)',
       'state - uttar pradesh (09)', 'state - bihar (10)',
       'state - sikkim (11)', 'state - arunachal pradesh (12)',
       'state - nagaland (13)', 'state - manipur (14)',
       'state - mizoram (15)', 'state - tripura (16)',
       'state - meghalaya (17)', 'state - assam (18)',
       'state - west bengal (19)', 'state - jharkhand (20)',
       'state - odisha (21)', 'state - chhattisgarh (22)',
       'state - madhya pradesh (23)', 'state - gujarat (24)',
       'state - daman & diu (25)', 'state - dadra & nagar haveli (26)',
       'state - maharashtra (27)', 'state - andhra pradesh (28)',
       'state - karnataka (29)', 'state - goa (30)',
       'state - lakshadweep (31)', 'state - kerala (32)',
       'state - tamil nadu (33)', 'state - puducherry (34)',
       'state - andaman & nicobar islands (35)'], dtype=object)

In [34]:
data1.iloc[0].tolist()[-1]

12541302

In [35]:
a = [5,10,15,20,25,30,50,70]
b = [9,14,19,24,29,49,69,99]
final_sum = []
for area in the_list:
    df = data1[data1['Area'] == area].copy()
    final_sum.append(df.iloc[0].tolist()[-1])
    for i,j in zip(a,b):
        val = 0
        for k in range(i,j+1):
            row = df.loc[df['Age'] == k].values.flatten().tolist()
            val+=row[-1]
        final_sum.append(val)
    r = df[df['Age'] == 'Age not stated'].values.flatten().tolist()
    final_sum.append(r[-1])

In [36]:
new_data2 = new_data2[new_data2['Total']!="Urban"].copy()

In [37]:
new_data2 = new_data2[new_data2['Total']!="Rural"].copy()

In [38]:
new_data2['row'] = final_sum

In [39]:
new_data2 = new_data2[new_data2['Total']!=new_data2['Age']].copy()

In [40]:
new_data2['percentage'] = (new_data2['T_persons']/new_data2['row'])*100

In [41]:
type(new_data2.groupby('Area')['percentage'].max())

pandas.core.series.Series

In [42]:
new_data2['new_column'] = new_data2.groupby(['Area'])['percentage'].transform('max')

In [43]:
new_data2 = new_data2[new_data2['percentage']==new_data2['new_column']].copy()

In [44]:
new_data2 = new_data2[['state','Area','Age','percentage']].copy()

In [45]:
new_data2.pop("Area")

39                jammu & kashmir
69               himachal pradesh
98                         punjab
133                    chandigarh
159                   uttarakhand
188                       haryana
223                  nct of delhi
248                     rajasthan
279                 uttar pradesh
308                         bihar
338                        sikkim
368             arunachal pradesh
399                      nagaland
430                       manipur
461                       mizoram
489                       tripura
521                     meghalaya
549                         assam
582                   west bengal
609                     jharkhand
638                        odisha
670                  chhattisgarh
698                madhya pradesh
728                       gujarat
761                   daman & diu
788          dadra & nagar haveli
819                   maharashtra
848                andhra pradesh
879                     karnataka
908                           goa
939                   lakshadweep
969                        kerala
999                    tamil nadu
1029                   puducherry
1058    andaman & nicobar islands
Name: Area, dtype: object

In [46]:
new_data2 = new_data2.rename(columns={'state':'state/ut','Age': 'age-group'})

In [47]:
bigdata = new_data2.append(fin_ind, ignore_index=True)

In [48]:
bigdata.sort_values("state/ut", axis = 0, ascending = True,inplace = True, na_position ='last')

In [49]:
bigdata.to_csv('age-india.csv',index=False)

In [50]:
bigdata

   state/ut age-group percentage
35       00     20-24  11.518442
0        01     20-24  29.580167
1        02     20-24   8.206521
2        03     15-19  45.763949
3        04       70+  42.989875
4        05     20-24   3.094835
5        06     15-19    7.31862
6        07       70+  15.147255
7        08     15-19   2.884065
8        09     20-24   2.443396
9        10     15-19    2.91843
10       11     15-19  45.798288
11       12     15-19  47.589249
12       13     20-24  40.339983
13       14     25-29  31.663321
14       15     30-49   7.420447
15       16     20-24   8.211385
16       17     30-49  14.862512
17       18     20-24  21.065613
18       19     50-69   4.457691
19       20     20-24   7.375031
20       21     15-19  22.309814
21       22     25-29   2.296116
22       23     15-19   2.963277
23       24     15-19  23.986559
24       25     30-49  18.178144
25       26     15-19  33.829749
26       27     20-24  27.068174
27       28     15-19  12.981033
28       29     20-24  17.577031
29       30     15-19  68.088694
30       31     20-24  25.990736
31       32     20-24  16.945888
32       33     20-24    4.58902
33       34     20-24   7.852489
34       35     15-19  28.747048